/*******************************************************************************
* 文 件 名：SHT11.h
* 功    能：SHT11温湿度传感器驱动头文件。
* 硬件连接：SHT11（在EMDOOR-Sensor-Temperature And Humidity传感器板上）
*           与CC2530的硬件连接关系如下所示：
*
*           SHT11                  CC253x
*
*           DATA                    P0.7
*           SCK                     P0.0
*******************************************************************************/

#ifndef HAL_SHT11_H
#define HAL_SHT11_H

#include "math.h"

enum {TEMP,HUMI};                                          // 温度，相对湿度枚举类型

#define	DATA   	                  P0_1                     // 使用CC2430的P0.4作为数据线 //p0.1// P0.7
#define	SCK   	                  P1_7                     // 使用CC2430的P0.5作为时钟线 //p1.7 // P0.0

#define noACK                      0                       // 不应答标志
#define ACK                        1                       // 应答标志

#define STATUS_REG_W              0x06                     // "写状态寄存器"命令
#define STATUS_REG_R              0x07                     // "读状态寄存器"命令
#define MEASURE_TEMP              0x03                     // "测量温度"命令
#define MEASURE_HUMI              0x05                     // "测量相对湿度"命令
#define RESET                     0x1e                     // "复位"命令



/*******************************************************************************
 * 函数名称：Hal_SHT11_Init
 *
 * 功能描述：CC2430与SHT11相连接的引脚初始化
 *
 * 参    数：无
 *
 * 返 回 值：无
 ******************************************************************************/
void Hal_SHT11_Init(void);


/*******************************************************************************
 * 函数名称：s_write_byte
 *
 * 功能描述：向SHT11写1个字节并检测SHT11是否应答
 *
 * 参    数：value  要写入的1字节数据
 *
 * 返 回 值：error=1表明SHT11未应答
 ******************************************************************************/
char s_write_byte(unsigned char value);


/*******************************************************************************
 * 函数名称：s_read_byte
 *
 * 功能描述：从SHT11读1个字节并当输入参数ack=1时给出应答
 *
 * 参    数：ack  应答标志
 *
 * 返 回 值：error=1表明SHT11未应答
 ******************************************************************************/
char s_read_byte(unsigned char ack);


/*******************************************************************************
 * 函数名称：s_transstart
 *
 * 功能描述：发送一个"启动传输"序列
 *                 _____         ________
 *           DATA:      |_______|
 *                     ___     ___
 *           SCK : ___|   |___|   |______
 *
 * 参    数：无
 *
 * 返 回 值：无
 ******************************************************************************/
void s_transstart(void);


/*******************************************************************************
 * 函数名称：s_connectionreset
 *
 * 功能描述：通信复位
 *                 _____________________________________________________         ________
 *           DATA:                                                      |_______|
 *                    _    _    _    _    _    _    _    _    _        ___     ___
 *           SCK : __| |__| |__| |__| |__| |__| |__| |__| |__| |______|   |___|   |______
 *
 * 参    数：无
 *
 * 返 回 值：无
 ******************************************************************************/
void s_connectionreset(void);


/*******************************************************************************
 * 函数名称：s_softreset
 *
 * 功能描述：软件复位
 *
 * 参    数：无
 *
 * 返 回 值：返回值为1表示SHT11未响应
 ******************************************************************************/
char s_softreset(void);


/*******************************************************************************
 * 函数名称：s_read_statusreg
 *
 * 功能描述：读取状态寄存器和校验和
 *
 * 参    数：p_value      状态寄存器的值
 *           p_checksum   校验和
 *
 * 返 回 值：返回值为1表示SHT11未响应
 ******************************************************************************/
char s_read_statusreg(unsigned char *p_value, unsigned char *p_checksum);


/*******************************************************************************
 * 函数名称：s_write_statusreg
 *
 * 功能描述：写状态寄存器
 *
 * 参    数：p_value      状态寄存器的值
 *
 * 返 回 值：返回值为1表示SHT11未响应
 ******************************************************************************/
char s_write_statusreg(unsigned char *p_value);


/*******************************************************************************
 * 函数名称：s_measure
 *
 * 功能描述：进行一次测量(相对湿度或温度)
 *
 * 参    数：p_value      测量值
 *           checksum     校验和
 *           mode         TEMP表示进行温度测量
 *                        HUMI表示进行相对湿度测量
 *
 * 返 回 值：返回值为1表示SHT11未响应
 ******************************************************************************/
char s_measure(unsigned char *p_value, unsigned char *p_checksum, unsigned char mode);


/*******************************************************************************
 * 函数名称：calc_sth11
 *
 * 功能描述：计算相对湿度和温度
 *
 * 参    数：p_humidity      SHT11采集到的相对湿度值(经过本函数的转换，该参数返回实际物理量的值)
 *           p_temperature   SHT11采集到的温度值(经过本函数的转换，该参数返回实际物理量的值)
 *
 * 返 回 值：无
 ******************************************************************************/
void calc_sth11(float *p_humidity ,float *p_temperature);


/*******************************************************************************
 * 函数名称：calc_dewpoint
 *
 * 功能描述：计算露点
 *
 * 参    数：h      相对湿度物理量值
 *           t      温度物理量值
 *
 * 返 回 值：露点值
 ******************************************************************************/
float calc_dewpoint(float h,float t);


#endif

