/*******************************************************************************
 * 文件名称：PowerModes(WakeUp By ST Or EINT)_Ex.c
 * 功    能：CC253x系列片上系统基础实验--- 功耗模式选择(由睡眠定时器或外部中断唤醒)
 * 描    述：让CC253x系列片上系统工作在各种功耗模式下：
 *           主动模式 LED1闪5次 进入 空闲(IDLE)模式 睡眠定时器2s后唤醒(回到主动模式)
 *           主动模式 LED2闪5次 进入 PM1模式 睡眠定时器3s后唤醒(回到主动模式)
 *           主动模式 LED3闪5次 进入 PM2模式 睡眠定时器4s后唤醒(回到主动模式)
 *           主动模式 LED4闪5次 进入 PM3模式 点按SW1外部中断唤醒(回到主动模式)
  * 作    者：HJL
 * 日    期：2012-9-11
 ******************************************************************************/


/* 包含头文件 */
/********************************************************************/
#include "ioCC2530.h"    // CC2530的头文件，包含对CC2530的寄存器、中断向量等的定义

/********************************************************************/
//定义led灯端口：p1.0, p1.1,p1.3, p1.4：
#define LED1 P1_0     // P1_0定义为P1.0
#define LED2 P1_1
#define LED3 P1_3
#define LED4 P1_4
#define SW1 P1_2      // P1_2定义为P1.2

/* 定义枚举类型 */
/********************************************************************/
enum SYSCLK_SRC{XOSC_32MHz,RC_16MHz};      // 定义系统时钟源(主时钟源)枚举类型
enum POWERMODE{PM_IDLE=0,PM_1,PM_2,PM_3};  // 定义功耗模式
/********************************************************************/
/*********************************************************************
 * 函数名称：SystemClockSourceSelect
 * 功    能：选择系统时钟源(主时钟源)
 * 入口参数：source
 *             XOSC_32MHz  32MHz晶体振荡器
 *             RC_16MHz    16MHz RC振荡器
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
void SystemClockSourceSelect(enum SYSCLK_SRC source)
{
   unsigned char clkconcmd,clkconsta;
   if(source == RC_16MHz)
  {             
    CLKCONCMD &= 0x80;
    CLKCONCMD |= 0x49;    //01001001   
  }
  else if(source == XOSC_32MHz)
  {
    CLKCONCMD &= 0x80;
  }  
  
  /* 等待所选择的系统时钟源(主时钟源)稳定 */
  clkconcmd = CLKCONCMD;             // 读取时钟控制寄存器CLKCONCMD
  do
  {
    clkconsta = CLKCONSTA;           // 读取时钟状态寄存器CLKCONSTA
  } while(clkconsta != clkconcmd);  // 直到选择的系统时钟源(主时钟源)已经稳定 
}

/*********************************************************************
* 函数名称：delay
 * 功    能：软件延时
 * 入口参数：无
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
void delay(unsigned int time)
{ unsigned int i;
  unsigned char j;
  for(i = 0; i < time; i++)
  {  for(j = 0; j < 240; j++)
      {   asm("NOP");    // asm是内嵌汇编，nop是空操作,执行一个指令周期
          asm("NOP");
          asm("NOP");
       }  
   }  
}

/*********************************************************************
 * 函数名称：BlankLed
 * 功    能：LED灯闪烁。
 * 入口参数：n 闪烁n次
 * 出口参数：无
 * 返 回 值：无
 * 注    意：此函数高度依赖於MCU架构和编译器
 ********************************************************************/

void BlankLed(int n)
{
  int i; 
  for(i=0;i<5;i++)
    switch(n)
     { case 1: 
         LED1=0; 
         delay(20000);
         LED1=1; 
         delay(20000);
         break;
      case 2: 
         LED2=0; 
         delay(20000);
         LED2=1; 
         delay(20000); 
         break;
      case 3: 
         LED3=0; 
         delay(20000);
         LED3=1; 
         delay(20000);
         break;
      case 4: 
         LED4=0; 
         delay(20000);
         LED4=1; 
         delay(20000);
         break;
    }
    
  
}


/*********************************************************************
 * 函数名称：SetPowerMode
 * 功    能：设置功耗模式
 * 入口参数：pm  
 *             PM_IDLE  空闲模式
 *             PM_1     功耗模式PM1
 *             PM_2     功耗模式PM2
 *             PM_3     功耗模式PM3
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
void SetPowerMode(enum POWERMODE pm)
{
  /* 选择功耗模式 */
  /* 空闲模式 */
  if(pm == PM_IDLE)
  {
    SLEEPCMD &= ~0x03;
  }
  /* 功耗模式PM3*/
  else if(pm == PM_3)
  {
    SLEEPCMD |= ~0x03;
  }
  /* 其他功耗模式，即功耗模式PM1或PM2*/
  else
  {
    SLEEPCMD &= ~0x03;
    SLEEPCMD |= pm;
  }

  /* 进入所选择的功耗模式 */
  PCON |= 0x01;                            
  
  asm("NOP");    
}


/*********************************************************************
 * 函数名称：SetSleepTime
 * 功    能：设置睡眠时间，即设置睡眠定时器的比较值。
 * 入口参数：sec  处於功耗模式IDLE，PM1或PM2的时间。
 * 出口参数：无
 * 返 回 值：无
 * 注    意：使用32MHz晶体振荡器作为系统时钟源(主时钟源)，32KHz RC
 *           振荡器作为睡眠定时器的时钟源，根据CC253x系列片上系统的数
 *           据手册可知，32KHz RC振荡器被校准在32.753KHz。
 ********************************************************************/
void SetSleepTime(unsigned short sec)
{
  unsigned long sleeptime = 0;
  
  /* 读取睡眠定时器的当前计数值 */
  sleeptime |= ST0;
  sleeptime |= (unsigned long)ST1 <<  8;
  sleeptime |= (unsigned long)ST2 << 16;
  
  /* 根据指定的睡眠时间计算出应设置的比较值 */
  sleeptime += ((unsigned long)sec * (unsigned long)32753);
  
  /* 设置比较值 */
  while((STLOAD & 0x01) == 0);  // 等待允许加载新的比较值
  ST2 = (unsigned char)(sleeptime >> 16);
  ST1 = (unsigned char)(sleeptime >> 8);
  ST0 = (unsigned char) sleeptime;  
   
  
}



/*********************************************************************
 * 函数名称：initIO
 * 功    能：初始化系统IO,定时器T1控制状态寄存器
 * 入口参数：无
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
void initIO()
{    P1SEL &= ~0x1F;     // 设置LED1、SW1为普通IO口
     P1DIR |= 0x1B ;    // 设置LED1为输出
     P1DIR &= ~0X04;	//Sw1按键在 P1.2,设定为输入
     LED1 = 0;         //灭 LED
     LED2 = 0;         //灭 LED
     LED3 = 0;         //灭 LED
     LED4 = 0;         //灭 LED
     PICTL &= ~0x02;  //配置P1口的中断边沿为上升沿产生中断
     
     P1IFG &= ~0x04;   // 清除P1.2中断标志
     P1IF =0;  // 清除P1口中断标志
  }

/*********************************************************************
 * 函数名称：EINT_ISR
 * 功    能：外部中断服务函数
 * 入口参数：无
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
#pragma vector=P1INT_VECTOR
__interrupt void EINT_ISR(void)
{
    EA = 0;           // 关闭全局中断
   /* 若是P1.2产生的中断 */
    if(P1IFG & 0x04)
    { 
        /* 等待用户释放按键，并消抖 */
       while(SW1 == 0);    //低电平有效
       delay(100);
       while(SW1 == 0);  
       
       P1IFG &= ~0x04;   // 清除P1.2中断标志
       P1IF =0;  // 清除P1口中断标志
       
       P1IEN &= ~ 0x04;  //禁止P1.2中断
       IEN2 &= ~ 0x10;  //禁止P1口中断  
    }
    EA = 1;          // 使能全局中断  
}





/*********************************************************************
 * 函数名称：ST_ISR
 * 功    能：睡眠定时器中断服务函数
 * 入口参数：无
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
#pragma vector=ST_VECTOR
__interrupt void ST_ISR(void)
{
    EA=0;          //关全局中断
  
   STIF=0;     //睡眠定时器中断标志清0
   STIE=0;    // 禁止睡眠定时器中断
   
   EA = 1;          // 使能全局中断
}


/*********************************************************************
 * 函数名称：main
 * 功    能：main函数入口
 * 入口参数：无
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
void main(void)
{
  SystemClockSourceSelect(XOSC_32MHz);  // 选择32MHz晶体振荡器作为系统时钟源(主时钟源)
  
  initIO();  //初始化IO 
  
  /* 使能全局中断 */
  EA = 1;

  while(1)
  {
    /* 功耗模式：主动模式 */
      LED2=0;  //LED灯灭
      LED3=0;  
      LED4=0;  
    
      BlankLed(1);  //LED1闪烁5次
    
    /* 功耗模式：空闲模式 */
    SetSleepTime(2);        // 设置睡眠时间为2秒
    IRCON &= ~0x80;         // 清除睡眠定时器中断标志
    IEN0 |= (0x01 << 5);    // 使能睡眠定时器中断
   
    SetPowerMode(PM_IDLE);  // 进入空闲模式
    
    /* 功耗模式：主动模式 */
     BlankLed(2);  //LED2闪烁5次
    
   
    /* 功耗模式：PM1 */
    SetSleepTime(3);        // 设置睡眠时间为3秒
    IRCON &= ~0x80;         // 清除睡眠定时器中断标志
    IEN0 |= (0x01 << 5);    // 使能睡眠定时器中断
    SetPowerMode(PM_1);     // 进入功耗模式PM1
    
    /* 功耗模式：主动模式 */
    BlankLed(3);  //LED3闪烁5次
    
    /* 功耗模式：PM2 */
    SetSleepTime(4);        // 设置睡眠时间为4秒
    IRCON &= ~0x80;         // 清除睡眠定时器中断标志
    IEN0 |= (0x01 << 5);    // 使能睡眠定时器中断 
     SetPowerMode(PM_2);     // 进入功耗模式PM2 
    
    /* 功耗模式：主动模式 */
     BlankLed(4);  //LED4闪烁5次    
   
    /* 功耗模式：PM3 */    
       P1IEN |=0x04;  //使能P1.2中断
       IEN2 |= 0x10;  //使能P1口中断
       SetPowerMode(PM_3);     // 进入功耗模式PM3   
  } 
  
}