

/*******************************************************************************
 * 文件名称：clock.c
 * 功    能：CC253x系列片上系统基础实验 --- 系统时钟源(主时钟源)的选择
 * 描    述：分别选择32MHz晶体振荡器和16MHz RC振荡器作为CC253x系列片上系统的系统
 *           时钟源(主时钟源)，看相同的LED闪烁代码在这两种时钟源下的闪烁速度的区
 *           别。
 * 硬件连接：led灯端口：  LED1（D3）-p1.0
                          LED2（D4）-p1.1
                          LED3（D5）-p1.3
                          LED4（D6）-p1.4
 * 作    者：HJL
 * 日    期：2012-8-13

 ******************************************************************************/

/* 包含头文件 */
/********************************************************************/
#include "ioCC2530.h"  // CC2530的头文件，包含对CC2530的寄存器、中断向量等的定义
/********************************************************************/

/* 定义枚举类型 */
/********************************************************************/
enum SYSCLK_SRC{XOSC_32MHz,RC_16MHz};  // 定义系统时钟源(主时钟源)枚举类型
/********************************************************************/
//定义led灯端口：p1.3, p1.4：
#define LED3 P1_3     // P1_3定义为P1.3
#define LED4 P1_4     // P1_4定义为P1.4

/*********************************************************************
* 函数名称：delay
 * 功    能：软件延时
 * 入口参数：无
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
void delay(unsigned int time)
{ unsigned int i;
  unsigned char j;
  for(i = 0; i < time; i++)
  {  for(j = 0; j < 240; j++)
      {   asm("NOP");    // asm是内嵌汇编，nop是空操作,执行一个指令周期
          asm("NOP");
          asm("NOP");
       }  
   }  
}

/*********************************************************************
 * 函数名称：init
 * 功    能：初始化系统IO,定时器T1控制状态寄存器
 * 入口参数：无
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
void init(void)
{    P1SEL &= ~0x18;     // 设置LED3、LED4为普通IO口
     P1DIR |= 0x018 ;    // 设置LED3、LED4为输出
     LED3 = 0;
     LED4 =0;	//灭 LED  
}


/*********************************************************************
 * 函数名称：BlinkLeds
 * 功    能：闪烁LED
 * 入口参数：无
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
void BlinkLeds(void)  //闪烁LED
{
  LED3 = !LED3;  
  LED4 = !LED4;       
  delay(30000);   // 延时 
}



/*********************************************************************
 * 函数名称：SystemClockSourceSelect
 * 功    能：选择系统时钟源(主时钟源)
 * 入口参数：source
 *             XOSC_32MHz  32MHz晶体振荡器
 *             RC_16MHz    16MHz RC振荡器
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
void SystemClockSourceSelect(enum SYSCLK_SRC source)
{
   unsigned char clkconcmd,clkconsta;
  
   /*
     系统时钟源(主时钟源)选择16MHz RC振荡器，定时器tick设置为16MHz，时钟速度设置为16MHz
     CLKCONCMD.OSC32K[b7]不改变      32KHz时钟源选择保持先前设置
     CLKCONCMD.OSC[b6] = 1           系统时钟源(主时钟源)选择16MHz RC振荡器
     CLKCONCMD.TICKSPD[b5..b3] = 001 定时器tick设置为16MHz
     CLKCONCMD.CLKSPD[b2..b0] = 001  时钟速度设置为16MHz
   */
  if(source == RC_16MHz)
  {             
    CLKCONCMD &= 0x80;
    CLKCONCMD |= 0x49;    //01001001   
  }

  
  /*
     系统时钟源(主时钟源)选择32MHz晶体振荡器，定时器tick设置为32MHz，时钟速度设置为32MHz
     CLKCONCMD.OSC32K[b7]不改变      32KHz时钟源选择保持先前设置
     CLKCONCMD.OSC[b6] = 0           系统时钟源(主时钟源)选择32MHz晶体振荡器
     CLKCONCMD.TICKSPD[b5..b3] = 000 定时器tick设置为32MHz
     CLKCONCMD.CLKSPD[b2..b0] = 000  时钟速度设置为32MHz
   */  
  else if(source == XOSC_32MHz)
  {
    CLKCONCMD &= 0x80;
  }
  
  
  /* 等待所选择的系统时钟源(主时钟源)稳定 */
  clkconcmd = CLKCONCMD;             // 读取时钟控制寄存器CLKCONCMD
  do
  {
    clkconsta = CLKCONSTA;           // 读取时钟状态寄存器CLKCONSTA
  }while(clkconsta != clkconcmd);  // 直到CLKCONSTA寄存器的值与CLKCONCMD寄存
                                       // 器的值一致，说明所选择的系统时钟源(主
                                       // 时钟源)已经稳定  
}



/*********************************************************************
 * 函数名称：main
 * 功    能：main函数入口
 * 入口参数：无
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
void main(void)
{  
   init();   //调用初始化函数
 
   int i;
   while(1)
   { 
     /* 选择16MHz RC振荡器作为系统时钟源(主时钟源) ，然后闪烁LED */
      SystemClockSourceSelect(RC_16MHz);
      for(i=0;i<8;i++)       
           BlinkLeds();       

     /* 选择32MHz晶体振荡器作为系统时钟源(主时钟源) ，然后闪烁LED */    
       SystemClockSourceSelect(XOSC_32MHz);
       for(i=0;i<8;i++)        
            BlinkLeds();
       
    }

}