/*******************************************************************************
 * 文件名称：WDT2.c
 * 功    能：CC253x系列片上系统基础实验--- 看门狗定时器作为定时器(中断方式)
 * 描    述：让看门狗定时器工作在定时器模式，定时时间为1s。采用中断方式，在中
 *           断服务函数中切换一次LED1的亮灭状态。 * 
 * 作    者：HJL
 * 日    期：2012-9-10
 ******************************************************************************/

/* 包含头文件 */
/********************************************************************/
#include "ioCC2530.h"    // CC2530的头文件，包含对CC2530的寄存器、中断向量等的定义
/********************************************************************/
//定义led灯端口：p1.1
#define LED1 P1_0     // P1_0定义为P1.0
/*********************************************************************
 * 函数名称：systemClock_Init
 * 功    能：系统时钟初始化
 * 入口参数：无
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
void systemClock_Init(void)
{
   unsigned char clkconcmd,clkconsta;
   CLKCONCMD &= 0x80;
 
  /* 等待所选择的系统时钟源(主时钟源)稳定 */
  clkconcmd = CLKCONCMD;             // 读取时钟控制寄存器CLKCONCMD
  do
  {
    clkconsta = CLKCONSTA;           // 读取时钟状态寄存器CLKCONSTA
  } while(clkconsta != clkconcmd);  // 直到选择的系统时钟源(主时钟源)已经稳定 
}


/*********************************************************************
 * 函数名称：led_Init
 * 功    能：LED初始化
 * 入口参数：无
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
void led_Init(void)
{
  P1SEL  = 0x00;              //P1为普通 I/O 口
  P1DIR |= 0x01;              //P1.0输出  
   LED1 = 0;  // 灭LED1  
  
}


/*********************************************************************
 * 函数名称：watchdog_Init
 * 功    能：看门狗初始化
 * 入口参数：无
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
void watchdog_Init(void)   
{
   WDCTL = 0x00;              //时间间隔一秒
   WDCTL |= (0x03 << 2) ;  // 定时器模式  

  IEN2 |= (0x01 << 5);  //看门狗定时器(定时器模式)中断使能
  EA = 1;   //// 使能全局中断 
}
/*********************************************************************
 * 函数名称：WDT_ISR
 * 功    能：看门狗定时器(定时器模式)中断服务函数
 * 入口参数：无
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
#pragma vector=WDT_VECTOR
__interrupt void WDT_ISR(void)
{
  EA = 0;           // 关闭全局中断
  IRCON2 &= ~0x10;  // 清零看门狗定时器中断标志
  LED1=!LED1;    
  EA = 1;          // 使能全局中断    
}

/*********************************************************************
 * 函数名称：main
 * 功    能：main函数入口
 * 入口参数：无
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
void main(void)
{
  systemClock_Init();    //系统时钟
  led_Init();            //LED灯初始化
  watchdog_Init();      //看门狗初始化  

  while(1);
}